adafruit-FT232H.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-22 Tue 22:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using Adafruit FT232H Breakout in NixOS WSL</title>
<meta name="author" content="Alexander Vorobiev" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Using Adafruit FT232H Breakout in NixOS WSL</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org139ad4e">1. Resources</a></li>
<li><a href="#org1e4e92b">2. WSL USB</a></li>
<li><a href="#org09dc1ec">3. FTDI rules for libusb</a></li>
<li><a href="#org7dcdfec">4. FTDI test</a></li>
<li><a href="#orgabf8ff8">5. Pinout</a></li>
<li><a href="#org53ccabe">6. Adafruit Blinka</a></li>
<li><a href="#org1e73432">7. LED</a></li>
<li><a href="#orgb5ccb32">8. org configuration</a></li>
</ul>
</div>
</div>
<div id="outline-container-org139ad4e" class="outline-2">
<h2 id="org139ad4e"><span class="section-number-2">1.</span> Resources</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>The board <a href="https://www.adafruit.com/product/2264">Adafruit FT232H Breakout - General Purpose USB to GPIO, SPI, I2C -  USB C &amp; Stemma QT</a></li>
<li>The chip  <a href="https://ftdichip.com/products/ft232hq/">FT232H &#x2013; Hi-Speed Single Channel USB UART/FIFO IC</a></li>
<li>Examples <a href="https://learn.adafruit.com/circuitpython-on-any-computer-with-ft232h">https://learn.adafruit.com/circuitpython-on-any-computer-with-ft232h</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1e4e92b" class="outline-2">
<h2 id="org1e4e92b"><span class="section-number-2">2.</span> WSL USB</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://learn.microsoft.com/en-us/windows/wsl/connect-usb">https://learn.microsoft.com/en-us/windows/wsl/connect-usb</a>
</p>
<div class="org-src-container">
<pre class="src src-sh">/mnt/c/Program<span style="color: #2aa198;">\ </span>Files/usbipd-win/usbipd.exe wsl list
</pre>
</div>

<pre class="example">
BUSID  VID:PID    DEVICE                                                        STATE
1-2    0403:6014  USB Serial Converter                                          Not attached
1-4    27c6:55b4  Goodix fingerprint SGX                                        Not attached
1-7    174f:2426  Integrated Camera                                             Not attached
1-10   8087:0aaa  Intel(R) Wireless Bluetooth(R)                                Not attached

</pre>


<div class="org-src-container">
<pre class="src src-sh" id="org454970f">/mnt/c/Program<span style="color: #2aa198;">\ </span>Files/usbipd-win/usbipd.exe wsl list | <span style="color: #b58900; font-weight: bold;">\</span>
    grep <span style="color: #2aa198;">'USB Serial Converter'</span> | <span style="color: #b58900; font-weight: bold;">\</span>
    sed -E <span style="color: #2aa198;">'s/^([0-9]+-[0-9]+).*/\1/'</span>
</pre>
</div>

<pre class="example">
1-2
</pre>


<p>
Run as Windows administrator for busid corresponding to "USB Serial Converter"
</p>
<div class="org-src-container">
<pre class="src src-sh">usbipd wsl attach --busid $<span style="color: #268bd2;">busid</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">lsusb | grep 0403
</pre>
</div>

<pre class="example">
Bus 001 Device 002: ID 0403:6014 Future Technology Devices International, Ltd FT232H Single HS USB-UART/FIFO IC
</pre>
</div>
</div>

<div id="outline-container-org09dc1ec" class="outline-2">
<h2 id="org09dc1ec"><span class="section-number-2">3.</span> FTDI rules for libusb</h2>
<div class="outline-text-2" id="text-3">
<p>
Those needs to be added to <code>services.udev.extraRules</code>
</p>

<div class="org-src-container">
<pre class="src src-sh">grep 0403 /etc/udev/rules.d/99-local.rules
</pre>
</div>

<pre class="example">
SUBSYSTEM=="usb", ATTR{idVendor}=="0403", ATTR{idProduct}=="6001", GROUP="plugdev", MODE="0666"
SUBSYSTEM=="usb", ATTR{idVendor}=="0403", ATTR{idProduct}=="6011", GROUP="plugdev", MODE="0666"
SUBSYSTEM=="usb", ATTR{idVendor}=="0403", ATTR{idProduct}=="6010", GROUP="plugdev", MODE="0666"
SUBSYSTEM=="usb", ATTR{idVendor}=="0403", ATTR{idProduct}=="6014", GROUP="plugdev", MODE="0666"
SUBSYSTEM=="usb", ATTR{idVendor}=="0403", ATTR{idProduct}=="6015", GROUP="plugdev", MODE="0666"
</pre>
</div>
</div>
<div id="outline-container-org7dcdfec" class="outline-2">
<h2 id="org7dcdfec"><span class="section-number-2">4.</span> FTDI test</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://en.wikipedia.org/wiki/FTDI">https://en.wikipedia.org/wiki/FTDI</a>
</p>

<p>
<a href="https://eblot.github.io/pyftdi/">https://eblot.github.io/pyftdi/</a>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">from</span> pyftdi.ftdi <span style="color: #859900; font-weight: bold;">import</span> Ftdi
Ftdi().open_from_url(<span style="color: #2aa198;">'ftdi:///?'</span>)
</pre>
</div>

<p>
Or use the script shipped with pyftdi:
</p>

<div class="org-src-container">
<pre class="src src-sh">ftdi_urls.py --verbose
</pre>
</div>
<pre class="example">
Available interfaces:
  ftdi://ftdi:232h:1/1   (￿￿￿￿￿￿)

</pre>
</div>
</div>
<div id="outline-container-orgabf8ff8" class="outline-2">
<h2 id="orgabf8ff8"><span class="section-number-2">5.</span> Pinout</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="https://learn.adafruit.com/circuitpython-on-any-computer-with-ft232h/pinouts">https://learn.adafruit.com/circuitpython-on-any-computer-with-ft232h/pinouts</a>
</p>
</div>
</div>
<div id="outline-container-org53ccabe" class="outline-2">
<h2 id="org53ccabe"><span class="section-number-2">6.</span> Adafruit Blinka</h2>
<div class="outline-text-2" id="text-6">
<p>
This repository contains a selection of packages emulating the CircuitPython API for devices or hosts running CPython or MicroPython.
<a href="https://github.com/adafruit/Adafruit_Blinka/">https://github.com/adafruit/Adafruit_Blinka/</a>
</p>
</div>
</div>
<div id="outline-container-org1e73432" class="outline-2">
<h2 id="org1e73432"><span class="section-number-2">7.</span> LED</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="https://learn.adafruit.com/circuitpython-on-any-computer-with-ft232h/gpio">https://learn.adafruit.com/circuitpython-on-any-computer-with-ft232h/gpio</a>
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> time
<span style="color: #586e75;"># </span><span style="color: #586e75;">Adafruit Blinka modules</span>
<span style="color: #859900; font-weight: bold;">import</span> board
<span style="color: #859900; font-weight: bold;">import</span> digitalio

<span style="color: #268bd2;">led</span> = digitalio.DigitalInOut(board.C0)
led.<span style="color: #268bd2;">direction</span> = digitalio.Direction.OUTPUT

<span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #839496; font-weight: bold;">range</span>(10):
    led.<span style="color: #268bd2;">value</span> = <span style="color: #268bd2; font-weight: bold;">True</span>
    time.sleep(0.5)
    led.<span style="color: #268bd2;">value</span> = <span style="color: #268bd2; font-weight: bold;">False</span>
    time.sleep(0.5)
</pre>
</div>

<pre class="example">
None
</pre>
</div>
</div>
<div id="outline-container-orgb5ccb32" class="outline-2">
<h2 id="orgb5ccb32"><span class="section-number-2">8.</span> org configuration</h2>
<div class="outline-text-2" id="text-8">
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Vorobiev</p>
<p class="date">Created: 2023-08-22 Tue 22:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>